# -*- coding: utf-8 -*-

"""
descr: 数仓通用常量
auther: lj.michale
create_date: 2025/9/27 15:54
file_name: dw_common_constant.py
"""

# 数仓通用数据域
DW_DATA_DOMAIN = {
    '营销域': {
        "销售域":"",
        "运营域":{"会员域":"","交易域":""}
    },
    '‌供应链域': {
        "物流域":"",
        "采购域":"",
        "库存域":""
    },
    '制造域': {
        "设备域":"",
        "质量域":""
    },
    '商品域': "",
    '用户域': "",
    '管理域': {
        "人资域":"",
        "财务域":""
    },
    '基础信息域': {
        "作业域":"",
        "数据域":""
    }
}

